### 1. Import the necessary libraries

In [1]:
import pandas as pd

### 2. Import the dataset from https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user
### 3. Assign it to a variable called users and use the 'user_id' as index

###**인덱스를 설정하려면 set_index('해당 컬럼 이름')**

In [8]:
url = 'https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user'

df=pd.read_csv(url, sep='|')
df.info()

df=df.set_index('user_id')
df

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 943 entries, 0 to 942
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   user_id     943 non-null    int64
 1   age         943 non-null    int64
 2   gender      943 non-null    object
 3   occupation  943 non-null    object
 4   zip_code    943 non-null    object
dtypes: int64(2), object(3)
memory usage: 37.0+ KB

         age gender     occupation zip_code
user_id
1         24      M     technician    85711
2         53      F          other    94043
3         23      M         writer    32067
4         24      M     technician    43537
5         33      F          other    15213
...      ...    ...            ...      ...
939       26      F        student    33319
940       32      M  administrator    02215
941       20      M        student    97229
942       48      F      librarian    78209
943       22      M        student    77841

[943 rows x 4 columns]

### 4. See the first 25 entries

In [9]:
df.head(25)

         age gender     occupation zip_code
user_id
1         24      M     technician    85711
2         53      F          other    94043
3         23      M         writer    32067
4         24      M     technician    43537
5         33      F          other    15213
6         42      M      executive    98101
7         57      M  administrator    91344
8         36      M  administrator    05201
9         29      M        student    01002
10        53      M         lawyer    90703
11        39      F          other    30329
12        28      F          other    06405
13        47      M       educator    29206
14        45      M      scientist    55106
15        49      F       educator    97301
16        21      M  entertainment    10309
17        30      M     programmer    06355
18        35      F          other    37212
19        40      M      librarian    02138
20        42      F      homemaker    95660
21        26      M         writer    30068
22        25      M         writer    40206
23        30      F         artist    48197
24        21      F         artist    94533
25        39      M       engineer    55107

### 5. See the last 10 entries

In [10]:
df.tail(10)

         age gender     occupation zip_code
user_id
934       61      M       engineer    22902
935       42      M         doctor    66221
936       24      M          other    32789
937       48      M       educator    98072
938       38      F     technician    55038
939       26      F        student    33319
940       32      M  administrator    02215
941       20      M        student    97229
942       48      F      librarian    78209
943       22      M        student    77841

### 6. What is the number of observations in the dataset?

In [21]:
df.shape[0]

943

### 7. What is the number of columns in the dataset?

In [22]:
df.shape[1]

4

###**항상 잊지말기!!!!!!!!!!!!!!!**
컬럼과 로우의 갯수 세는 방법
###**shape 활용하기**

### 8. Print the name of all the columns.

In [23]:
df.columns

Index(['age', 'gender', 'occupation', 'zip_code'], dtype='object')

### 9. How is the dataset indexed?

In [25]:
df.index

Int64Index([  1,   2,   3,   4,   5,   6,   7,   8,   9,  10,
            ...
            934, 935, 936, 937, 938, 939, 940, 941, 942, 943],
           dtype='int64', name='user_id', length=943)

### 10. What is the data type of each column?

In [30]:
df.dtypes
#df['age'].dtype

dtype('int64')

###**컬럼들의 데이터 타입을 확인하려면 dtypes를 사용하고,**
###**컬럼 하나의 데이터 타입을 확인하려면 dtype를 사용하면 된다!!**
###**또는 간단하게 그냥 info를 사용해도 데이터 타입 확인이 가능하다**

In [31]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 943 entries, 1 to 943
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   age         943 non-null    int64
 1   gender      943 non-null    object
 2   occupation  943 non-null    object
 3   zip_code    943 non-null    object
dtypes: int64(1), object(3)
memory usage: 36.8+ KB

### 11. Print only the occupation column

In [38]:
df['occupation']

user_id
1         technician
2              other
3             writer
4         technician
5              other
           ...
939          student
940    administrator
941          student
942        librarian
943          student
Name: occupation, Length: 943, dtype: object

### 12. How many different occupations are in this dataset?

In [48]:
df['occupation'].value_counts().count()

21

###아니면 다음과 같은 방법을 사용해도 된다.
###***서로 다른 값의 로우를 카운트하려면 nunique를 사용하자 !!***

In [49]:
df['occupation'].nunique()

21

### 13. What is the most frequent occupation?

In [47]:
df['occupation'].value_counts().head(1)

student    196
Name: occupation, dtype: int64

### 14. Summarize the DataFrame.

In [34]:
df.describe()

              age
count  943.000000
mean    34.051962
std     12.192740
min      7.000000
25%     25.000000
50%     31.000000
75%     43.000000
max     73.000000

### 15. Summarize all the columns

In [51]:
df.describe(include='all')

               age gender occupation zip_code
count   943.000000    943        943      943
unique         NaN      2         21      795
top            NaN      M    student    55414
freq           NaN    670        196        9
mean     34.051962    NaN        NaN      NaN
std      12.192740    NaN        NaN      NaN
min       7.000000    NaN        NaN      NaN
25%      25.000000    NaN        NaN      NaN
50%      31.000000    NaN        NaN      NaN
75%      43.000000    NaN        NaN      NaN
max      73.000000    NaN        NaN      NaN

###원래 describe를 하면 기본적으로 ***숫자형 컬럼만 통계***를 내는데,
###파라미터로 ***include='all'*** 값을 추가하면 다른 데이터 타입까지 통계를 내준다!!!
###꿀팁

### 16. Summarize only the occupation column

In [52]:
df['occupation'].describe()

count         943
unique         21
top       student
freq          196
Name: occupation, dtype: object

### 17. What is the mean age of users?

In [54]:
df['age'].mean()

34.05196182396607

####문제에 기재되어있진 않지만 그래도 나이의 평균이니까 반올림을 추가해준다.

In [55]:
round(df['age'].mean())

34

### 18. What is the age with least occurrence?

In [65]:
df['age'].value_counts().tail(5)

11    1
10    1
73    1
66    1
7     1
Name: age, dtype: int64